Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/puf.h
#define PUF_DISABLE_ENROLL_Pos                _UINT32_(1)                                          /* (PUF_DISABLE) ENROLL Command Disable bit Position */
#define PUF_DISABLE_ENROLL_Msk                (_UINT32_(0x1) << PUF_DISABLE_ENROLL_Pos)            /* (PUF_DISABLE) ENROLL Command Disable bit Mask */
#define PUF_DISABLE_ENROLL(value)             (PUF_DISABLE_ENROLL_Msk & (_UINT32_(value) << PUF_DISABLE_ENROLL_Pos)) /* Assignment of value for ENROLL in the PUF_DISABLE register */
#define   PUF_DISABLE_ENROLL_0_Val            _UINT32_(0x0)                                        /* (PUF_DISABLE) Command is enabled.  */
#define   PUF_DISABLE_ENROLL_1_Val            _UINT32_(0x1)                                        /* (PUF_DISABLE) Command is disabled.  */
#define PUF_DISABLE_ENROLL_0                  (PUF_DISABLE_ENROLL_0_Val << PUF_DISABLE_ENROLL_Pos) /* (PUF_DISABLE) Command is enabled. Position */
#define PUF_DISABLE_ENROLL_1                  (PUF_DISABLE_ENROLL_1_Val << PUF_DISABLE_ENROLL_Pos) /* (PUF_DISABLE) Command is disabled. Position */
#define PUF_DISABLE_START_Pos                 _UINT32_(2)                                          /* (PUF_DISABLE) START Command Disable bit Position */
#define PUF_DISABLE_START_Msk                 (_UINT32_(0x1) << PUF_DISABLE_START_Pos)             /* (PUF_DISABLE) START Command Disable bit Mask */
#define PUF_DISABLE_START(value)              (PUF_DISABLE_START_Msk & (_UINT32_(value) << PUF_DISABLE_START_Pos)) /* Assignment of value for START in the PUF_DISABLE register */
#define   PUF_DISABLE_START_0_Val             _UINT32_(0x0)                                        /* (PUF_DISABLE) Command is enabled.  */
#define   PUF_DISABLE_START_1_Val             _UINT32_(0x1)                                        /* (PUF_DISABLE) Command is disabled.  */
#define PUF_DISABLE_START_0                   (PUF_DISABLE_START_0_Val << PUF_DISABLE_START_Pos)   /* (PUF_DISABLE) Command is enabled. Position */
#define PUF_DISABLE_START_1                   (PUF_DISABLE_START_1_Val << PUF_DISABLE_START_Pos)   /* (PUF_DISABLE) Command is disabled. Position */
#define PUF_DISABLE_RECONSTRUCT_Pos           _UINT32_(3)                                          /* (PUF_DISABLE) RECONSTRUCT Command Disable bit Position */
#define PUF_DISABLE_RECONSTRUCT_Msk           (_UINT32_(0x1) << PUF_DISABLE_RECONSTRUCT_Pos)       /* (PUF_DISABLE) RECONSTRUCT Command Disable bit Mask */
#define PUF_DISABLE_RECONSTRUCT(value)        (PUF_DISABLE_RECONSTRUCT_Msk & (_UINT32_(value) << PUF_DISABLE_RECONSTRUCT_Pos)) /* Assignment of value for RECONSTRUCT in the PUF_DISABLE register */
#define   PUF_DISABLE_RECONSTRUCT_0_Val       _UINT32_(0x0)                                        /* (PUF_DISABLE) Command is enabled.  */
#define   PUF_DISABLE_RECONSTRUCT_1_Val       _UINT32_(0x1)                                        /* (PUF_DISABLE) Command is disabled.  */
#define PUF_DISABLE_RECONSTRUCT_0             (PUF_DISABLE_RECONSTRUCT_0_Val << PUF_DISABLE_RECONSTRUCT_Pos) /* (PUF_DISABLE) Command is enabled. Position */
#define PUF_DISABLE_RECONSTRUCT_1             (PUF_DISABLE_RECONSTRUCT_1_Val << PUF_DISABLE_RECONSTRUCT_Pos) /* (PUF_DISABLE) Command is disabled. Position */
#define PUF_DISABLE_STOP_Pos                  _UINT32_(5)                                          /* (PUF_DISABLE) STOP Command Disable bit Position */
#define PUF_DISABLE_STOP_Msk                  (_UINT32_(0x1) << PUF_DISABLE_STOP_Pos)              /* (PUF_DISABLE) STOP Command Disable bit Mask */
#define PUF_DISABLE_STOP(value)               (PUF_DISABLE_STOP_Msk & (_UINT32_(value) << PUF_DISABLE_STOP_Pos)) /* Assignment of value for STOP in the PUF_DISABLE register */
#define   PUF_DISABLE_STOP_0_Val              _UINT32_(0x0)                                        /* (PUF_DISABLE) Command is enabled.  */
#define   PUF_DISABLE_STOP_1_Val              _UINT32_(0x1)                                        /* (PUF_DISABLE) Command is disabled.  */
#define PUF_DISABLE_STOP_0                    (PUF_DISABLE_STOP_0_Val << PUF_DISABLE_STOP_Pos)     /* (PUF_DISABLE) Command is enabled. Position */
#define PUF_DISABLE_STOP_1                    (PUF_DISABLE_STOP_1_Val << PUF_DISABLE_STOP_Pos)     /* (PUF_DISABLE) Command is disabled. Position */
#define PUF_DISABLE_GET_KEY_Pos               _UINT32_(6)                                          /* (PUF_DISABLE) GET_KEY Command Disable bit Position */
#define PUF_DISABLE_GET_KEY_Msk               (_UINT32_(0x1) << PUF_DISABLE_GET_KEY_Pos)           /* (PUF_DISABLE) GET_KEY Command Disable bit Mask */
#define PUF_DISABLE_GET_KEY(value)            (PUF_DISABLE_GET_KEY_Msk & (_UINT32_(value) << PUF_DISABLE_GET_KEY_Pos)) /* Assignment of value for GET_KEY in the PUF_DISABLE register */
#define   PUF_DISABLE_GET_KEY_0_Val           _UINT32_(0x0)                                        /* (PUF_DISABLE) Command is enabled.  */
#define   PUF_DISABLE_GET_KEY_1_Val           _UINT32_(0x1)                                        /* (PUF_DISABLE) Command is disabled.  */
#define PUF_DISABLE_GET_KEY_0                 (PUF_DISABLE_GET_KEY_0_Val << PUF_DISABLE_GET_KEY_Pos) /* (PUF_DISABLE) Command is enabled. Position */
#define PUF_DISABLE_GET_KEY_1                 (PUF_DISABLE_GET_KEY_1_Val << PUF_DISABLE_GET_KEY_Pos) /* (PUF_DISABLE) Command is disabled. Position */
#define PUF_DISABLE_UNWRAP_Pos                _UINT32_(7)                                          /* (PUF_DISABLE) UNWRAP Command Disable bit Position */
#define PUF_DISABLE_UNWRAP_Msk                (_UINT32_(0x1) << PUF_DISABLE_UNWRAP_Pos)            /* (PUF_DISABLE) UNWRAP Command Disable bit Mask */
#define PUF_DISABLE_UNWRAP(value)             (PUF_DISABLE_UNWRAP_Msk & (_UINT32_(value) << PUF_DISABLE_UNWRAP_Pos)) /* Assignment of value for UNWRAP in the PUF_DISABLE register */
#define   PUF_DISABLE_UNWRAP_0_Val            _UINT32_(0x0)                                        /* (PUF_DISABLE) Command is enabled.  */
#define   PUF_DISABLE_UNWRAP_1_Val            _UINT32_(0x1)                                        /* (PUF_DISABLE) Command is disabled.  */
#define PUF_DISABLE_UNWRAP_0                  (PUF_DISABLE_UNWRAP_0_Val << PUF_DISABLE_UNWRAP_Pos) /* (PUF_DISABLE) Command is enabled. Position */
#define PUF_DISABLE_UNWRAP_1                  (PUF_DISABLE_UNWRAP_1_Val << PUF_DISABLE_UNWRAP_Pos) /* (PUF_DISABLE) Command is disabled. Position */
#define PUF_DISABLE_WRAP_GEN_RAND_Pos         _UINT32_(8)                                          /* (PUF_DISABLE) WRAP_GENERATE_RANDOM Command Disable bit Position */
#define PUF_DISABLE_WRAP_GEN_RAND_Msk         (_UINT32_(0x1) << PUF_DISABLE_WRAP_GEN_RAND_Pos)     /* (PUF_DISABLE) WRAP_GENERATE_RANDOM Command Disable bit Mask */
#define PUF_DISABLE_WRAP_GEN_RAND(value)      (PUF_DISABLE_WRAP_GEN_RAND_Msk & (_UINT32_(value) << PUF_DISABLE_WRAP_GEN_RAND_Pos)) /* Assignment of value for WRAP_GEN_RAND in the PUF_DISABLE register */
#define   PUF_DISABLE_WRAP_GEN_RAND_0_Val     _UINT32_(0x0)                                        /* (PUF_DISABLE) Command is enabled.  */
#define   PUF_DISABLE_WRAP_GEN_RAND_1_Val     _UINT32_(0x1)                                        /* (PUF_DISABLE) Command is disabled.  */
#define PUF_DISABLE_WRAP_GEN_RAND_0           (PUF_DISABLE_WRAP_GEN_RAND_0_Val << PUF_DISABLE_WRAP_GEN_RAND_Pos) /* (PUF_DISABLE) Command is enabled. Position */
#define PUF_DISABLE_WRAP_GEN_RAND_1           (PUF_DISABLE_WRAP_GEN_RAND_1_Val << PUF_DISABLE_WRAP_GEN_RAND_Pos) /* (PUF_DISABLE) Command is disabled. Position */
#define PUF_DISABLE_WRAP_Pos                  _UINT32_(9)                                          /* (PUF_DISABLE) WRAP Command Disable bit Position */
#define PUF_DISABLE_WRAP_Msk                  (_UINT32_(0x1) << PUF_DISABLE_WRAP_Pos)              /* (PUF_DISABLE) WRAP Command Disable bit Mask */
#define PUF_DISABLE_WRAP(value)               (PUF_DISABLE_WRAP_Msk & (_UINT32_(value) << PUF_DISABLE_WRAP_Pos)) /* Assignment of value for WRAP in the PUF_DISABLE register */
#define   PUF_DISABLE_WRAP_0_Val              _UINT32_(0x0)                                        /* (PUF_DISABLE) Command is enabled.  */
#define   PUF_DISABLE_WRAP_1_Val              _UINT32_(0x1)                                        /* (PUF_DISABLE) Command is disabled.  */
#define PUF_DISABLE_WRAP_0                    (PUF_DISABLE_WRAP_0_Val << PUF_DISABLE_WRAP_Pos)     /* (PUF_DISABLE) Command is enabled. Position */
#define PUF_DISABLE_WRAP_1                    (PUF_DISABLE_WRAP_1_Val << PUF_DISABLE_WRAP_Pos)     /* (PUF_DISABLE) Command is disabled. Position */
#define PUF_DISABLE_GEN_RAND_Pos              _UINT32_(15)                                         /* (PUF_DISABLE) GENERATE_RANDOM Command Disable bit Position */
#define PUF_DISABLE_GEN_RAND_Msk              (_UINT32_(0x1) << PUF_DISABLE_GEN_RAND_Pos)          /* (PUF_DISABLE) GENERATE_RANDOM Command Disable bit Mask */
#define PUF_DISABLE_GEN_RAND(value)           (PUF_DISABLE_GEN_RAND_Msk & (_UINT32_(value) << PUF_DISABLE_GEN_RAND_Pos)) /* Assignment of value for GEN_RAND in the PUF_DISABLE register */
#define   PUF_DISABLE_GEN_RAND_0_Val          _UINT32_(0x0)                                        /* (PUF_DISABLE) Command is enabled.  */
#define   PUF_DISABLE_GEN_RAND_1_Val          _UINT32_(0x1)                                        /* (PUF_DISABLE) Command is disabled.  */
#define PUF_DISABLE_GEN_RAND_0                (PUF_DISABLE_GEN_RAND_0_Val << PUF_DISABLE_GEN_RAND_Pos) /* (PUF_DISABLE) Command is enabled. Position */
#define PUF_DISABLE_GEN_RAND_1                (PUF_DISABLE_GEN_RAND_1_Val << PUF_DISABLE_GEN_RAND_Pos) /* (PUF_DISABLE) Command is disabled. Position */
#define PUF_DISABLE_SKIP_MEM_TEST_Pos         _UINT32_(29)                                         /* (PUF_DISABLE) SKIP_MEMORY TEST Command Control bit Position */
#define PUF_DISABLE_SKIP_MEM_TEST_Msk         (_UINT32_(0x1) << PUF_DISABLE_SKIP_MEM_TEST_Pos)     /* (PUF_DISABLE) SKIP_MEMORY TEST Command Control bit Mask */
#define PUF_DISABLE_SKIP_MEM_TEST(value)      (PUF_DISABLE_SKIP_MEM_TEST_Msk & (_UINT32_(value) << PUF_DISABLE_SKIP_MEM_TEST_Pos)) /* Assignment of value for SKIP_MEM_TEST in the PUF_DISABLE register */
#define   PUF_DISABLE_SKIP_MEM_TEST_0_Val     _UINT32_(0x0)                                        /* (PUF_DISABLE) Command is enabled / Not Skipped.  */
#define   PUF_DISABLE_SKIP_MEM_TEST_1_Val     _UINT32_(0x1)                                        /* (PUF_DISABLE) Command is disabled / Skipped during initialization  */
#define PUF_DISABLE_SKIP_MEM_TEST_0           (PUF_DISABLE_SKIP_MEM_TEST_0_Val << PUF_DISABLE_SKIP_MEM_TEST_Pos) /* (PUF_DISABLE) Command is enabled / Not Skipped. Position */
#define PUF_DISABLE_SKIP_MEM_TEST_1           (PUF_DISABLE_SKIP_MEM_TEST_1_Val << PUF_DISABLE_SKIP_MEM_TEST_Pos) /* (PUF_DISABLE) Command is disabled / Skipped during initialization Position */
#define PUF_DISABLE_TEST_MEM_Pos              _UINT32_(30)                                         /* (PUF_DISABLE) TEST_MEMORY Command Disable bit Position */
#define PUF_DISABLE_TEST_MEM_Msk              (_UINT32_(0x1) << PUF_DISABLE_TEST_MEM_Pos)          /* (PUF_DISABLE) TEST_MEMORY Command Disable bit Mask */
#define PUF_DISABLE_TEST_MEM(value)           (PUF_DISABLE_TEST_MEM_Msk & (_UINT32_(value) << PUF_DISABLE_TEST_MEM_Pos)) /* Assignment of value for TEST_MEM in the PUF_DISABLE register */
#define   PUF_DISABLE_TEST_MEM_0_Val          _UINT32_(0x0)                                        /* (PUF_DISABLE) Command is enabled.  */
#define   PUF_DISABLE_TEST_MEM_1_Val          _UINT32_(0x1)                                        /* (PUF_DISABLE) Command is disabled.  */
#define PUF_DISABLE_TEST_MEM_0                (PUF_DISABLE_TEST_MEM_0_Val << PUF_DISABLE_TEST_MEM_Pos) /* (PUF_DISABLE) Command is enabled. Position */
#define PUF_DISABLE_TEST_MEM_1                (PUF_DISABLE_TEST_MEM_1_Val << PUF_DISABLE_TEST_MEM_Pos) /* (PUF_DISABLE) Command is disabled. Position */
#define PUF_DISABLE_TEST_PUF_Pos              _UINT32_(31)                                         /* (PUF_DISABLE) TEST_PUF Command Disable bit Position */
#define PUF_DISABLE_TEST_PUF_Msk              (_UINT32_(0x1) << PUF_DISABLE_TEST_PUF_Pos)          /* (PUF_DISABLE) TEST_PUF Command Disable bit Mask */
#define PUF_DISABLE_TEST_PUF(value)           (PUF_DISABLE_TEST_PUF_Msk & (_UINT32_(value) << PUF_DISABLE_TEST_PUF_Pos)) /* Assignment of value for TEST_PUF in the PUF_DISABLE register */
#define   PUF_DISABLE_TEST_PUF_0_Val          _UINT32_(0x0)                                        /* (PUF_DISABLE) Command is enabled.  */
#define   PUF_DISABLE_TEST_PUF_1_Val          _UINT32_(0x1)                                        /* (PUF_DISABLE) Command is disabled.  */
#define PUF_DISABLE_TEST_PUF_0                (PUF_DISABLE_TEST_PUF_0_Val << PUF_DISABLE_TEST_PUF_Pos) /* (PUF_DISABLE) Command is enabled. Position */
#define PUF_DISABLE_TEST_PUF_1                (PUF_DISABLE_TEST_PUF_1_Val << PUF_DISABLE_TEST_PUF_Pos) /* (PUF_DISABLE) Command is disabled. Position */
#define PUF_DISABLE_Msk                       _UINT32_(0xE00083EE)                                 /* (PUF_DISABLE) Register Mask  */


