Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/puf.h
#define PUF_QK_SR_qk_busy_Pos                 _UINT32_(0)                                          /* (PUF_QK_SR) Operation is in progress Position */
#define PUF_QK_SR_qk_busy_Msk                 (_UINT32_(0x1) << PUF_QK_SR_qk_busy_Pos)             /* (PUF_QK_SR) Operation is in progress Mask */
#define PUF_QK_SR_qk_busy(value)              (PUF_QK_SR_qk_busy_Msk & (_UINT32_(value) << PUF_QK_SR_qk_busy_Pos)) /* Assignment of value for qk_busy in the PUF_QK_SR register */
#define PUF_QK_SR_qk_ok_Pos                   _UINT32_(1)                                          /* (PUF_QK_SR) Last operation was successful Position */
#define PUF_QK_SR_qk_ok_Msk                   (_UINT32_(0x1) << PUF_QK_SR_qk_ok_Pos)               /* (PUF_QK_SR) Last operation was successful Mask */
#define PUF_QK_SR_qk_ok(value)                (PUF_QK_SR_qk_ok_Msk & (_UINT32_(value) << PUF_QK_SR_qk_ok_Pos)) /* Assignment of value for qk_ok in the PUF_QK_SR register */
#define PUF_QK_SR_qk_error_Pos                _UINT32_(2)                                          /* (PUF_QK_SR) Last operation failed Position */
#define PUF_QK_SR_qk_error_Msk                (_UINT32_(0x1) << PUF_QK_SR_qk_error_Pos)            /* (PUF_QK_SR) Last operation failed Mask */
#define PUF_QK_SR_qk_error(value)             (PUF_QK_SR_qk_error_Msk & (_UINT32_(value) << PUF_QK_SR_qk_error_Pos)) /* Assignment of value for qk_error in the PUF_QK_SR register */
#define PUF_QK_SR_qk_zeroized_Pos             _UINT32_(3)                                          /* (PUF_QK_SR) QuiddiKey is in Zeroized or Locked state Position */
#define PUF_QK_SR_qk_zeroized_Msk             (_UINT32_(0x1) << PUF_QK_SR_qk_zeroized_Pos)         /* (PUF_QK_SR) QuiddiKey is in Zeroized or Locked state Mask */
#define PUF_QK_SR_qk_zeroized(value)          (PUF_QK_SR_qk_zeroized_Msk & (_UINT32_(value) << PUF_QK_SR_qk_zeroized_Pos)) /* Assignment of value for qk_zeroized in the PUF_QK_SR register */
#define PUF_QK_SR_qk_rejected_Pos             _UINT32_(4)                                          /* (PUF_QK_SR) Read: Last command was rejected Write 1: Clears this bit Position */
#define PUF_QK_SR_qk_rejected_Msk             (_UINT32_(0x1) << PUF_QK_SR_qk_rejected_Pos)         /* (PUF_QK_SR) Read: Last command was rejected Write 1: Clears this bit Mask */
#define PUF_QK_SR_qk_rejected(value)          (PUF_QK_SR_qk_rejected_Msk & (_UINT32_(value) << PUF_QK_SR_qk_rejected_Pos)) /* Assignment of value for qk_rejected in the PUF_QK_SR register */
#define PUF_QK_SR_qk_di_request_Pos           _UINT32_(5)                                          /* (PUF_QK_SR) Request for data in transfer via the QK_DIR register Position */
#define PUF_QK_SR_qk_di_request_Msk           (_UINT32_(0x1) << PUF_QK_SR_qk_di_request_Pos)       /* (PUF_QK_SR) Request for data in transfer via the QK_DIR register Mask */
#define PUF_QK_SR_qk_di_request(value)        (PUF_QK_SR_qk_di_request_Msk & (_UINT32_(value) << PUF_QK_SR_qk_di_request_Pos)) /* Assignment of value for qk_di_request in the PUF_QK_SR register */
#define PUF_QK_SR_qk_do_request_Pos           _UINT32_(6)                                          /* (PUF_QK_SR) Request for data out transfer via the QK_DOR register Position */
#define PUF_QK_SR_qk_do_request_Msk           (_UINT32_(0x1) << PUF_QK_SR_qk_do_request_Pos)       /* (PUF_QK_SR) Request for data out transfer via the QK_DOR register Mask */
#define PUF_QK_SR_qk_do_request(value)        (PUF_QK_SR_qk_do_request_Msk & (_UINT32_(value) << PUF_QK_SR_qk_do_request_Pos)) /* Assignment of value for qk_do_request in the PUF_QK_SR register */
#define PUF_QK_SR_Msk                         _UINT32_(0x0000007F)                                 /* (PUF_QK_SR) Register Mask  */


/* -------- PUF_QK_AR : (PUF Offset: 0x20C) ( R/ 32) Allow register; The Allow register indicates which operations are currently allowed. -------- */
#define PUF_QK_AR_RESETVALUE                  _UINT32_(0x00)                                       /*  (PUF_QK_AR) Allow register; The Allow register indicates which operations are currently allowed.  Reset Value */

#define PUF_QK_AR_qk_allow_enroll_Pos         _UINT32_(1)                                          /* (PUF_QK_AR) 0: Enroll operation is not allowed 1: Enroll operation is allowed Position */
#define PUF_QK_AR_qk_allow_enroll_Msk         (_UINT32_(0x1) << PUF_QK_AR_qk_allow_enroll_Pos)     /* (PUF_QK_AR) 0: Enroll operation is not allowed 1: Enroll operation is allowed Mask */
#define PUF_QK_AR_qk_allow_enroll(value)      (PUF_QK_AR_qk_allow_enroll_Msk & (_UINT32_(value) << PUF_QK_AR_qk_allow_enroll_Pos)) /* Assignment of value for qk_allow_enroll in the PUF_QK_AR register */
#define PUF_QK_AR_qk_allow_start_Pos          _UINT32_(2)                                          /* (PUF_QK_AR) 0: Start operation is not allowed 1: Start operation is allowed Position */
#define PUF_QK_AR_qk_allow_start_Msk          (_UINT32_(0x1) << PUF_QK_AR_qk_allow_start_Pos)      /* (PUF_QK_AR) 0: Start operation is not allowed 1: Start operation is allowed Mask */
#define PUF_QK_AR_qk_allow_start(value)       (PUF_QK_AR_qk_allow_start_Msk & (_UINT32_(value) << PUF_QK_AR_qk_allow_start_Pos)) /* Assignment of value for qk_allow_start in the PUF_QK_AR register */
#define PUF_QK_AR_qk_allow_reconstruct_Pos    _UINT32_(3)                                          /* (PUF_QK_AR) 0: Reconstruct operation is not allowed 1: Reconstruct operation is allowed Position */
#define PUF_QK_AR_qk_allow_reconstruct_Msk    (_UINT32_(0x1) << PUF_QK_AR_qk_allow_reconstruct_Pos) /* (PUF_QK_AR) 0: Reconstruct operation is not allowed 1: Reconstruct operation is allowed Mask */
#define PUF_QK_AR_qk_allow_reconstruct(value) (PUF_QK_AR_qk_allow_reconstruct_Msk & (_UINT32_(value) << PUF_QK_AR_qk_allow_reconstruct_Pos)) /* Assignment of value for qk_allow_reconstruct in the PUF_QK_AR register */
#define PUF_QK_AR_qk_allow_stop_Pos           _UINT32_(5)                                          /* (PUF_QK_AR) 0: Stop operation is not allowed 1: Stop operation is allowed Position */
#define PUF_QK_AR_qk_allow_stop_Msk           (_UINT32_(0x1) << PUF_QK_AR_qk_allow_stop_Pos)       /* (PUF_QK_AR) 0: Stop operation is not allowed 1: Stop operation is allowed Mask */
#define PUF_QK_AR_qk_allow_stop(value)        (PUF_QK_AR_qk_allow_stop_Msk & (_UINT32_(value) << PUF_QK_AR_qk_allow_stop_Pos)) /* Assignment of value for qk_allow_stop in the PUF_QK_AR register */
#define PUF_QK_AR_qk_allow_get_key_Pos        _UINT32_(6)                                          /* (PUF_QK_AR) 0: Get Key operation is not allowed 1: Get Key operation is allowed Position */
#define PUF_QK_AR_qk_allow_get_key_Msk        (_UINT32_(0x1) << PUF_QK_AR_qk_allow_get_key_Pos)    /* (PUF_QK_AR) 0: Get Key operation is not allowed 1: Get Key operation is allowed Mask */
#define PUF_QK_AR_qk_allow_get_key(value)     (PUF_QK_AR_qk_allow_get_key_Msk & (_UINT32_(value) << PUF_QK_AR_qk_allow_get_key_Pos)) /* Assignment of value for qk_allow_get_key in the PUF_QK_AR register */
#define PUF_QK_AR_qk_allow_unwrap_Pos         _UINT32_(7)                                          /* (PUF_QK_AR) 0: Unwrap operation is not allowed 1: Unwrap operation is allowed Position */
#define PUF_QK_AR_qk_allow_unwrap_Msk         (_UINT32_(0x1) << PUF_QK_AR_qk_allow_unwrap_Pos)     /* (PUF_QK_AR) 0: Unwrap operation is not allowed 1: Unwrap operation is allowed Mask */
#define PUF_QK_AR_qk_allow_unwrap(value)      (PUF_QK_AR_qk_allow_unwrap_Msk & (_UINT32_(value) << PUF_QK_AR_qk_allow_unwrap_Pos)) /* Assignment of value for qk_allow_unwrap in the PUF_QK_AR register */
#define PUF_QK_AR_qk_allow_wrap_generated_random_Pos _UINT32_(8)                                          /* (PUF_QK_AR) 0: Wrap Generated Random operation is not allowed 1: Wrap Generated Random operation is allowed Position */
#define PUF_QK_AR_qk_allow_wrap_generated_random_Msk (_UINT32_(0x1) << PUF_QK_AR_qk_allow_wrap_generated_random_Pos) /* (PUF_QK_AR) 0: Wrap Generated Random operation is not allowed 1: Wrap Generated Random operation is allowed Mask */
#define PUF_QK_AR_qk_allow_wrap_generated_random(value) (PUF_QK_AR_qk_allow_wrap_generated_random_Msk & (_UINT32_(value) << PUF_QK_AR_qk_allow_wrap_generated_random_Pos)) /* Assignment of value for qk_allow_wrap_generated_random in the PUF_QK_AR register */
#define PUF_QK_AR_qk_allow_wrap_Pos           _UINT32_(9)                                          /* (PUF_QK_AR) 0: Wrap operation is not allowed 1: Wrap operation is allowed Position */
#define PUF_QK_AR_qk_allow_wrap_Msk           (_UINT32_(0x1) << PUF_QK_AR_qk_allow_wrap_Pos)       /* (PUF_QK_AR) 0: Wrap operation is not allowed 1: Wrap operation is allowed Mask */
#define PUF_QK_AR_qk_allow_wrap(value)        (PUF_QK_AR_qk_allow_wrap_Msk & (_UINT32_(value) << PUF_QK_AR_qk_allow_wrap_Pos)) /* Assignment of value for qk_allow_wrap in the PUF_QK_AR register */
#define PUF_QK_AR_qk_allow_generate_random_Pos _UINT32_(15)                                         /* (PUF_QK_AR) 0: Generate Random operation is not allowed 1: Generate Random operation is allowed Position */
#define PUF_QK_AR_qk_allow_generate_random_Msk (_UINT32_(0x1) << PUF_QK_AR_qk_allow_generate_random_Pos) /* (PUF_QK_AR) 0: Generate Random operation is not allowed 1: Generate Random operation is allowed Mask */
#define PUF_QK_AR_qk_allow_generate_random(value) (PUF_QK_AR_qk_allow_generate_random_Msk & (_UINT32_(value) << PUF_QK_AR_qk_allow_generate_random_Pos)) /* Assignment of value for qk_allow_generate_random in the PUF_QK_AR register */
#define PUF_QK_AR_qk_allow_test_memory_Pos    _UINT32_(30)                                         /* (PUF_QK_AR) 0: Test Memory operation is not allowed 1: Test Memory operation is allowed Position */
#define PUF_QK_AR_qk_allow_test_memory_Msk    (_UINT32_(0x1) << PUF_QK_AR_qk_allow_test_memory_Pos) /* (PUF_QK_AR) 0: Test Memory operation is not allowed 1: Test Memory operation is allowed Mask */
#define PUF_QK_AR_qk_allow_test_memory(value) (PUF_QK_AR_qk_allow_test_memory_Msk & (_UINT32_(value) << PUF_QK_AR_qk_allow_test_memory_Pos)) /* Assignment of value for qk_allow_test_memory in the PUF_QK_AR register */
#define PUF_QK_AR_qk_allow_test_puf_Pos       _UINT32_(31)                                         /* (PUF_QK_AR) 0: Test PUF operation is not allowed 1: Test PUF operation is allowed Position */
#define PUF_QK_AR_qk_allow_test_puf_Msk       (_UINT32_(0x1) << PUF_QK_AR_qk_allow_test_puf_Pos)   /* (PUF_QK_AR) 0: Test PUF operation is not allowed 1: Test PUF operation is allowed Mask */
#define PUF_QK_AR_qk_allow_test_puf(value)    (PUF_QK_AR_qk_allow_test_puf_Msk & (_UINT32_(value) << PUF_QK_AR_qk_allow_test_puf_Pos)) /* Assignment of value for qk_allow_test_puf in the PUF_QK_AR register */
#define PUF_QK_AR_Msk                         _UINT32_(0xC00083EE)                                 /* (PUF_QK_AR) Register Mask  */


/* -------- PUF_QK_IER : (PUF Offset: 0x210) (R/W 32) Interrupt Enable register; With the Interrupt Enable register all QuiddiKey interrupts can be enabled or disabled, without changing the Interrupt Mask register. -------- */
#define PUF_QK_IER_RESETVALUE                 _UINT32_(0x00)                                       /*  (PUF_QK_IER) Interrupt Enable register; With the Interrupt Enable register all QuiddiKey interrupts can be enabled or disabled, without changing the Interrupt Mask register.  Reset Value */

#define PUF_QK_IER_qk_int_en_Pos              _UINT32_(0)                                          /* (PUF_QK_IER) 0: Disables all QuiddiKey interrupts 1: Enables all QuiddiKey interrupts that are enabled in the Interrupt Mask register Position */
#define PUF_QK_IER_qk_int_en_Msk              (_UINT32_(0x1) << PUF_QK_IER_qk_int_en_Pos)          /* (PUF_QK_IER) 0: Disables all QuiddiKey interrupts 1: Enables all QuiddiKey interrupts that are enabled in the Interrupt Mask register Mask */
#define PUF_QK_IER_qk_int_en(value)           (PUF_QK_IER_qk_int_en_Msk & (_UINT32_(value) << PUF_QK_IER_qk_int_en_Pos)) /* Assignment of value for qk_int_en in the PUF_QK_IER register */
#define PUF_QK_IER_Msk                        _UINT32_(0x00000001)                                 /* (PUF_QK_IER) Register Mask  */


/* -------- PUF_QK_IMR : (PUF Offset: 0x214) (R/W 32) Interrupt Mask register; Individual QuiddiKey interrupts can be enabled or disabled with the Interrupt Mask register. -------- */
#define PUF_QK_IMR_RESETVALUE                 _UINT32_(0x00)                                       /*  (PUF_QK_IMR) Interrupt Mask register; Individual QuiddiKey interrupts can be enabled or disabled with the Interrupt Mask register.  Reset Value */

#define PUF_QK_IMR_qk_int_en_busy_Pos         _UINT32_(0)                                          /* (PUF_QK_IMR) Enables the busy interrupt Position */
#define PUF_QK_IMR_qk_int_en_busy_Msk         (_UINT32_(0x1) << PUF_QK_IMR_qk_int_en_busy_Pos)     /* (PUF_QK_IMR) Enables the busy interrupt Mask */
#define PUF_QK_IMR_qk_int_en_busy(value)      (PUF_QK_IMR_qk_int_en_busy_Msk & (_UINT32_(value) << PUF_QK_IMR_qk_int_en_busy_Pos)) /* Assignment of value for qk_int_en_busy in the PUF_QK_IMR register */
#define PUF_QK_IMR_qk_int_en_ok_Pos           _UINT32_(1)                                          /* (PUF_QK_IMR) Enables the ok interrupt Position */
#define PUF_QK_IMR_qk_int_en_ok_Msk           (_UINT32_(0x1) << PUF_QK_IMR_qk_int_en_ok_Pos)       /* (PUF_QK_IMR) Enables the ok interrupt Mask */
#define PUF_QK_IMR_qk_int_en_ok(value)        (PUF_QK_IMR_qk_int_en_ok_Msk & (_UINT32_(value) << PUF_QK_IMR_qk_int_en_ok_Pos)) /* Assignment of value for qk_int_en_ok in the PUF_QK_IMR register */
#define PUF_QK_IMR_qk_int_en_error_Pos        _UINT32_(2)                                          /* (PUF_QK_IMR) Enables the error interrupt Position */
#define PUF_QK_IMR_qk_int_en_error_Msk        (_UINT32_(0x1) << PUF_QK_IMR_qk_int_en_error_Pos)    /* (PUF_QK_IMR) Enables the error interrupt Mask */
#define PUF_QK_IMR_qk_int_en_error(value)     (PUF_QK_IMR_qk_int_en_error_Msk & (_UINT32_(value) << PUF_QK_IMR_qk_int_en_error_Pos)) /* Assignment of value for qk_int_en_error in the PUF_QK_IMR register */
#define PUF_QK_IMR_qk_int_en_zeroized_Pos     _UINT32_(3)                                          /* (PUF_QK_IMR) Enables the zeroized interrupt Position */
#define PUF_QK_IMR_qk_int_en_zeroized_Msk     (_UINT32_(0x1) << PUF_QK_IMR_qk_int_en_zeroized_Pos) /* (PUF_QK_IMR) Enables the zeroized interrupt Mask */
#define PUF_QK_IMR_qk_int_en_zeroized(value)  (PUF_QK_IMR_qk_int_en_zeroized_Msk & (_UINT32_(value) << PUF_QK_IMR_qk_int_en_zeroized_Pos)) /* Assignment of value for qk_int_en_zeroized in the PUF_QK_IMR register */
#define PUF_QK_IMR_qk_int_en_rejected_Pos     _UINT32_(4)                                          /* (PUF_QK_IMR) Enables the rejected interrupt Position */
#define PUF_QK_IMR_qk_int_en_rejected_Msk     (_UINT32_(0x1) << PUF_QK_IMR_qk_int_en_rejected_Pos) /* (PUF_QK_IMR) Enables the rejected interrupt Mask */
#define PUF_QK_IMR_qk_int_en_rejected(value)  (PUF_QK_IMR_qk_int_en_rejected_Msk & (_UINT32_(value) << PUF_QK_IMR_qk_int_en_rejected_Pos)) /* Assignment of value for qk_int_en_rejected in the PUF_QK_IMR register */
#define PUF_QK_IMR_qk_int_en_di_request_Pos   _UINT32_(5)                                          /* (PUF_QK_IMR) Enables the data in request interrupt Position */
#define PUF_QK_IMR_qk_int_en_di_request_Msk   (_UINT32_(0x1) << PUF_QK_IMR_qk_int_en_di_request_Pos) /* (PUF_QK_IMR) Enables the data in request interrupt Mask */
#define PUF_QK_IMR_qk_int_en_di_request(value) (PUF_QK_IMR_qk_int_en_di_request_Msk & (_UINT32_(value) << PUF_QK_IMR_qk_int_en_di_request_Pos)) /* Assignment of value for qk_int_en_di_request in the PUF_QK_IMR register */
#define PUF_QK_IMR_qk_int_en_do_request_Pos   _UINT32_(6)                                          /* (PUF_QK_IMR) Enables the data out request interrupt Position */
#define PUF_QK_IMR_qk_int_en_do_request_Msk   (_UINT32_(0x1) << PUF_QK_IMR_qk_int_en_do_request_Pos) /* (PUF_QK_IMR) Enables the data out request interrupt Mask */
#define PUF_QK_IMR_qk_int_en_do_request(value) (PUF_QK_IMR_qk_int_en_do_request_Msk & (_UINT32_(value) << PUF_QK_IMR_qk_int_en_do_request_Pos)) /* Assignment of value for qk_int_en_do_request in the PUF_QK_IMR register */
#define PUF_QK_IMR_Msk                        _UINT32_(0x0000007F)                                 /* (PUF_QK_IMR) Register Mask  */


