Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/puf.h
/* -------- PUF_QK_DATA_SRC : (PUF Offset: 0x224) (R/W 32) Data Source register; The Data Source register defines via which interface data must be provided to QuiddiKey. Combinations of bits may be 1 at a time. -------- */
#define PUF_QK_DATA_SRC_RESETVALUE            _UINT32_(0x00)                                       /*  (PUF_QK_DATA_SRC) Data Source register; The Data Source register defines via which interface data must be provided to QuiddiKey. Combinations of bits may be 1 at a time.  Reset Value */

#define PUF_QK_DATA_SRC_qk_src_dir_Pos        _UINT32_(0)                                          /* (PUF_QK_DATA_SRC) Data must be provided via the QK_DIR register Position */
#define PUF_QK_DATA_SRC_qk_src_dir_Msk        (_UINT32_(0x1) << PUF_QK_DATA_SRC_qk_src_dir_Pos)    /* (PUF_QK_DATA_SRC) Data must be provided via the QK_DIR register Mask */
#define PUF_QK_DATA_SRC_qk_src_dir(value)     (PUF_QK_DATA_SRC_qk_src_dir_Msk & (_UINT32_(value) << PUF_QK_DATA_SRC_qk_src_dir_Pos)) /* Assignment of value for qk_src_dir in the PUF_QK_DATA_SRC register */
#define PUF_QK_DATA_SRC_qk_src_si_Pos         _UINT32_(1)                                          /* (PUF_QK_DATA_SRC) Data must be provided via the SI interface Position */
#define PUF_QK_DATA_SRC_qk_src_si_Msk         (_UINT32_(0x1) << PUF_QK_DATA_SRC_qk_src_si_Pos)     /* (PUF_QK_DATA_SRC) Data must be provided via the SI interface Mask */
#define PUF_QK_DATA_SRC_qk_src_si(value)      (PUF_QK_DATA_SRC_qk_src_si_Msk & (_UINT32_(value) << PUF_QK_DATA_SRC_qk_src_si_Pos)) /* Assignment of value for qk_src_si in the PUF_QK_DATA_SRC register */
#define PUF_QK_DATA_SRC_Msk                   _UINT32_(0x00000003)                                 /* (PUF_QK_DATA_SRC) Register Mask  */


/* -------- PUF_QK_KEY_INDEX : (PUF Offset: 0x228) ( R/ 32) Key Index register; The Key Index register provides the index of the key that is currently output. -------- */
#define PUF_QK_KEY_INDEX_RESETVALUE           _UINT32_(0x00)                                       /*  (PUF_QK_KEY_INDEX) Key Index register; The Key Index register provides the index of the key that is currently output.  Reset Value */

#define PUF_QK_KEY_INDEX_qk_key_inde_Pos      _UINT32_(0)                                          /* (PUF_QK_KEY_INDEX) Value of the Key Index Position */
#define PUF_QK_KEY_INDEX_qk_key_inde_Msk      (_UINT32_(0xF) << PUF_QK_KEY_INDEX_qk_key_inde_Pos)  /* (PUF_QK_KEY_INDEX) Value of the Key Index Mask */
#define PUF_QK_KEY_INDEX_qk_key_inde(value)   (PUF_QK_KEY_INDEX_qk_key_inde_Msk & (_UINT32_(value) << PUF_QK_KEY_INDEX_qk_key_inde_Pos)) /* Assignment of value for qk_key_inde in the PUF_QK_KEY_INDEX register */
#define PUF_QK_KEY_INDEX_Msk                  _UINT32_(0x0000000F)                                 /* (PUF_QK_KEY_INDEX) Register Mask  */


/* -------- PUF_QK_DIR : (PUF Offset: 0x2A0) ( /W 32) Data Input register; The Data Input register is used to transfer data to QuiddiKey. It can only be written when input data is requested (indicated by the qk_di_request signal). When written at any other moment, or when read, an error response is generated. Depending on the way the system is configured and connected, this may generate an exception. -------- */
#define PUF_QK_DIR_RESETVALUE                 _UINT32_(0x00)                                       /*  (PUF_QK_DIR) Data Input register; The Data Input register is used to transfer data to QuiddiKey. It can only be written when input data is requested (indicated by the qk_di_request signal). When written at any other moment, or when read, an error response is generated. Depending on the way the system is configured and connected, this may generate an exception.  Reset Value */

#define PUF_QK_DIR_qk_di_Pos                  _UINT32_(0)                                          /* (PUF_QK_DIR) Input data to QuiddiKey Position */
#define PUF_QK_DIR_qk_di_Msk                  (_UINT32_(0xFFFFFFFF) << PUF_QK_DIR_qk_di_Pos)       /* (PUF_QK_DIR) Input data to QuiddiKey Mask */
#define PUF_QK_DIR_qk_di(value)               (PUF_QK_DIR_qk_di_Msk & (_UINT32_(value) << PUF_QK_DIR_qk_di_Pos)) /* Assignment of value for qk_di in the PUF_QK_DIR register */
#define PUF_QK_DIR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (PUF_QK_DIR) Register Mask  */


/* -------- PUF_QK_DOR : (PUF Offset: 0x2A8) ( R/ 32) Data Output register; The Data Output register is used to transfer data from QuiddiKey. It can only be read when input data is available (indicated by the qk_do_request signal). When read at any other moment, or when written, an error response is generated. Depending on the way the system is configured and connected, this may generate an exception. -------- */
#define PUF_QK_DOR_RESETVALUE                 _UINT32_(0x00)                                       /*  (PUF_QK_DOR) Data Output register; The Data Output register is used to transfer data from QuiddiKey. It can only be read when input data is available (indicated by the qk_do_request signal). When read at any other moment, or when written, an error response is generated. Depending on the way the system is configured and connected, this may generate an exception.  Reset Value */

#define PUF_QK_DOR_qk_do_Pos                  _UINT32_(0)                                          /* (PUF_QK_DOR) Output data from QuiddiKey Position */
#define PUF_QK_DOR_qk_do_Msk                  (_UINT32_(0xFFFFFFFF) << PUF_QK_DOR_qk_do_Pos)       /* (PUF_QK_DOR) Output data from QuiddiKey Mask */
#define PUF_QK_DOR_qk_do(value)               (PUF_QK_DOR_qk_do_Msk & (_UINT32_(value) << PUF_QK_DOR_qk_do_Pos)) /* Assignment of value for qk_do in the PUF_QK_DOR register */
#define PUF_QK_DOR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (PUF_QK_DOR) Register Mask  */


/* -------- PUF_QK_MISC : (PUF Offset: 0x2C0) (R/W 32) Miscellaneous register; The Miscellaneous register defines miscellaneous settings for QuiddiKey. These usually need to be configured only once after power up orreset. -------- */
#define PUF_QK_MISC_RESETVALUE                _UINT32_(0x01)                                       /*  (PUF_QK_MISC) Miscellaneous register; The Miscellaneous register defines miscellaneous settings for QuiddiKey. These usually need to be configured only once after power up orreset.  Reset Value */

#define PUF_QK_MISC_qk_data_endianness_Pos    _UINT32_(0)                                          /* (PUF_QK_MISC) Defines the endianness of data in QK_DIR and QK_DOR: 0: Little endian 1: Big endian (default) Position */
#define PUF_QK_MISC_qk_data_endianness_Msk    (_UINT32_(0x1) << PUF_QK_MISC_qk_data_endianness_Pos) /* (PUF_QK_MISC) Defines the endianness of data in QK_DIR and QK_DOR: 0: Little endian 1: Big endian (default) Mask */
#define PUF_QK_MISC_qk_data_endianness(value) (PUF_QK_MISC_qk_data_endianness_Msk & (_UINT32_(value) << PUF_QK_MISC_qk_data_endianness_Pos)) /* Assignment of value for qk_data_endianness in the PUF_QK_MISC register */
#define PUF_QK_MISC_Msk                       _UINT32_(0x00000001)                                 /* (PUF_QK_MISC) Register Mask  */


/* -------- PUF_QK_IF_SR : (PUF Offset: 0x2D0) (R/W 32) Interface Status register; The status of the interface can be monitored with the Interface Status register. Writing 1 to a bit, clears the corresponding bit. -------- */
#define PUF_QK_IF_SR_RESETVALUE               _UINT32_(0x00)                                       /*  (PUF_QK_IF_SR) Interface Status register; The status of the interface can be monitored with the Interface Status register. Writing 1 to a bit, clears the corresponding bit.  Reset Value */

#define PUF_QK_IF_SR_reg_if_error_Pos         _UINT32_(0)                                          /* (PUF_QK_IF_SR) An error has occurred at the register interface Position */
#define PUF_QK_IF_SR_reg_if_error_Msk         (_UINT32_(0x1) << PUF_QK_IF_SR_reg_if_error_Pos)     /* (PUF_QK_IF_SR) An error has occurred at the register interface Mask */
#define PUF_QK_IF_SR_reg_if_error(value)      (PUF_QK_IF_SR_reg_if_error_Msk & (_UINT32_(value) << PUF_QK_IF_SR_reg_if_error_Pos)) /* Assignment of value for reg_if_error in the PUF_QK_IF_SR register */
#define PUF_QK_IF_SR_Msk                      _UINT32_(0x00000001)                                 /* (PUF_QK_IF_SR) Register Mask  */


/* -------- PUF_QK_TEST : (PUF Offset: 0x2D8) (R/W 32) Test register; With the Test register a BIST can be started. It also shows the result of the last BIST. -------- */
#define PUF_QK_TEST_RESETVALUE                _UINT32_(0x00)                                       /*  (PUF_QK_TEST) Test register; With the Test register a BIST can be started. It also shows the result of the last BIST.  Reset Value */

#define PUF_QK_TEST_qk_bist_enable_Pos        _UINT32_(0)                                          /* (PUF_QK_TEST) Isolates QuiddiKey and runs BIST Position */
#define PUF_QK_TEST_qk_bist_enable_Msk        (_UINT32_(0x1) << PUF_QK_TEST_qk_bist_enable_Pos)    /* (PUF_QK_TEST) Isolates QuiddiKey and runs BIST Mask */
#define PUF_QK_TEST_qk_bist_enable(value)     (PUF_QK_TEST_qk_bist_enable_Msk & (_UINT32_(value) << PUF_QK_TEST_qk_bist_enable_Pos)) /* Assignment of value for qk_bist_enable in the PUF_QK_TEST register */
#define PUF_QK_TEST_qk_bist_running_Pos       _UINT32_(4)                                          /* (PUF_QK_TEST) BIST is in progress or finishing up (after qk_bist_enable = 0) Position */
#define PUF_QK_TEST_qk_bist_running_Msk       (_UINT32_(0x1) << PUF_QK_TEST_qk_bist_running_Pos)   /* (PUF_QK_TEST) BIST is in progress or finishing up (after qk_bist_enable = 0) Mask */
#define PUF_QK_TEST_qk_bist_running(value)    (PUF_QK_TEST_qk_bist_running_Msk & (_UINT32_(value) << PUF_QK_TEST_qk_bist_running_Pos)) /* Assignment of value for qk_bist_running in the PUF_QK_TEST register */
#define PUF_QK_TEST_qk_bist_active_Pos        _UINT32_(5)                                          /* (PUF_QK_TEST) BIST is in progress Position */
#define PUF_QK_TEST_qk_bist_active_Msk        (_UINT32_(0x1) << PUF_QK_TEST_qk_bist_active_Pos)    /* (PUF_QK_TEST) BIST is in progress Mask */
#define PUF_QK_TEST_qk_bist_active(value)     (PUF_QK_TEST_qk_bist_active_Msk & (_UINT32_(value) << PUF_QK_TEST_qk_bist_active_Pos)) /* Assignment of value for qk_bist_active in the PUF_QK_TEST register */
#define PUF_QK_TEST_qk_bist_ok_Pos            _UINT32_(6)                                          /* (PUF_QK_TEST) BIST has passed Position */
#define PUF_QK_TEST_qk_bist_ok_Msk            (_UINT32_(0x1) << PUF_QK_TEST_qk_bist_ok_Pos)        /* (PUF_QK_TEST) BIST has passed Mask */
#define PUF_QK_TEST_qk_bist_ok(value)         (PUF_QK_TEST_qk_bist_ok_Msk & (_UINT32_(value) << PUF_QK_TEST_qk_bist_ok_Pos)) /* Assignment of value for qk_bist_ok in the PUF_QK_TEST register */
#define PUF_QK_TEST_qk_bist_error_Pos         _UINT32_(7)                                          /* (PUF_QK_TEST) BIST has failed Position */
#define PUF_QK_TEST_qk_bist_error_Msk         (_UINT32_(0x1) << PUF_QK_TEST_qk_bist_error_Pos)     /* (PUF_QK_TEST) BIST has failed Mask */
#define PUF_QK_TEST_qk_bist_error(value)      (PUF_QK_TEST_qk_bist_error_Msk & (_UINT32_(value) << PUF_QK_TEST_qk_bist_error_Pos)) /* Assignment of value for qk_bist_error in the PUF_QK_TEST register */
#define PUF_QK_TEST_qk_allow_bist_Pos         _UINT32_(31)                                         /* (PUF_QK_TEST) BIST is not allowed Position */
#define PUF_QK_TEST_qk_allow_bist_Msk         (_UINT32_(0x1) << PUF_QK_TEST_qk_allow_bist_Pos)     /* (PUF_QK_TEST) BIST is not allowed Mask */
#define PUF_QK_TEST_qk_allow_bist(value)      (PUF_QK_TEST_qk_allow_bist_Msk & (_UINT32_(value) << PUF_QK_TEST_qk_allow_bist_Pos)) /* Assignment of value for qk_allow_bist in the PUF_QK_TEST register */
#define PUF_QK_TEST_Msk                       _UINT32_(0x800000F1)                                 /* (PUF_QK_TEST) Register Mask  */


