Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/puf.h
/* -------- PUF_QK_PSR : (PUF Offset: 0x2DC) ( R/ 32) PUF Score register; The PUF Score register shows the value of the PUF Score that was obtained during the last Test PUF, Enroll, Start or Reconstruct operation. -------- */
#define PUF_QK_PSR_RESETVALUE                 _UINT32_(0x0F)                                       /*  (PUF_QK_PSR) PUF Score register; The PUF Score register shows the value of the PUF Score that was obtained during the last Test PUF, Enroll, Start or Reconstruct operation.  Reset Value */

#define PUF_QK_PSR_qk_puf_score_Pos           _UINT32_(0)                                          /* (PUF_QK_PSR) PUF score obtained during the last Test PUF, Enroll, Start or Reconstruct operation Position */
#define PUF_QK_PSR_qk_puf_score_Msk           (_UINT32_(0xF) << PUF_QK_PSR_qk_puf_score_Pos)       /* (PUF_QK_PSR) PUF score obtained during the last Test PUF, Enroll, Start or Reconstruct operation Mask */
#define PUF_QK_PSR_qk_puf_score(value)        (PUF_QK_PSR_qk_puf_score_Msk & (_UINT32_(value) << PUF_QK_PSR_qk_puf_score_Pos)) /* Assignment of value for qk_puf_score in the PUF_QK_PSR register */
#define PUF_QK_PSR_Msk                        _UINT32_(0x0000000F)                                 /* (PUF_QK_PSR) Register Mask  */


/* -------- PUF_QK_HW_RUC0 : (PUF Offset: 0x2E0) ( R/ 32) Module Restrict User Context 0 register; The Module Restrict User Context 0 register shows the values of the qk_restrict_user_context_0 signal on the signal interface. -------- */
#define PUF_QK_HW_RUC0_RESETVALUE             _UINT32_(0x00)                                       /*  (PUF_QK_HW_RUC0) Module Restrict User Context 0 register; The Module Restrict User Context 0 register shows the values of the qk_restrict_user_context_0 signal on the signal interface.  Reset Value */

#define PUF_QK_HW_RUC0_qk_restrict_user_context_0_Pos _UINT32_(0)                                          /* (PUF_QK_HW_RUC0) For each bit in the User_Context_0 field: 0: This bit can be used 1: This bit cannot be used Position */
#define PUF_QK_HW_RUC0_qk_restrict_user_context_0_Msk (_UINT32_(0xFFFFFFFF) << PUF_QK_HW_RUC0_qk_restrict_user_context_0_Pos) /* (PUF_QK_HW_RUC0) For each bit in the User_Context_0 field: 0: This bit can be used 1: This bit cannot be used Mask */
#define PUF_QK_HW_RUC0_qk_restrict_user_context_0(value) (PUF_QK_HW_RUC0_qk_restrict_user_context_0_Msk & (_UINT32_(value) << PUF_QK_HW_RUC0_qk_restrict_user_context_0_Pos)) /* Assignment of value for qk_restrict_user_context_0 in the PUF_QK_HW_RUC0 register */
#define PUF_QK_HW_RUC0_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (PUF_QK_HW_RUC0) Register Mask  */


/* -------- PUF_QK_HW_RUC1 : (PUF Offset: 0x2E4) ( R/ 32) Module Restrict User Context 1 register; The Module Restrict User Context 1 register shows the values of the qk_restrict_user_context_1 signal on the signal interface. -------- */
#define PUF_QK_HW_RUC1_RESETVALUE             _UINT32_(0x00)                                       /*  (PUF_QK_HW_RUC1) Module Restrict User Context 1 register; The Module Restrict User Context 1 register shows the values of the qk_restrict_user_context_1 signal on the signal interface.  Reset Value */

#define PUF_QK_HW_RUC1_qk_restrict_user_context_1_Pos _UINT32_(0)                                          /* (PUF_QK_HW_RUC1) For each bit in the User_Context_1 field: 0: This bit can be used 1: This bit cannot be used Position */
#define PUF_QK_HW_RUC1_qk_restrict_user_context_1_Msk (_UINT32_(0xFFFFFFFF) << PUF_QK_HW_RUC1_qk_restrict_user_context_1_Pos) /* (PUF_QK_HW_RUC1) For each bit in the User_Context_1 field: 0: This bit can be used 1: This bit cannot be used Mask */
#define PUF_QK_HW_RUC1_qk_restrict_user_context_1(value) (PUF_QK_HW_RUC1_qk_restrict_user_context_1_Msk & (_UINT32_(value) << PUF_QK_HW_RUC1_qk_restrict_user_context_1_Pos)) /* Assignment of value for qk_restrict_user_context_1 in the PUF_QK_HW_RUC1 register */
#define PUF_QK_HW_RUC1_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (PUF_QK_HW_RUC1) Register Mask  */


/* -------- PUF_QK_HW_SETTINGS : (PUF Offset: 0x2F0) ( R/ 32) Module Settings register; The Module Settings register shows the values of the module settings on the signal interface. -------- */
#define PUF_QK_HW_SETTINGS_RESETVALUE         _UINT32_(0x00)                                       /*  (PUF_QK_HW_SETTINGS) Module Settings register; The Module Settings register shows the values of the module settings on the signal interface.  Reset Value */

#define PUF_QK_HW_SETTINGS_qk_disable_enroll_Pos _UINT32_(1)                                          /* (PUF_QK_HW_SETTINGS) 0: Enroll operations are enabled 1: Enroll operations are disabled Position */
#define PUF_QK_HW_SETTINGS_qk_disable_enroll_Msk (_UINT32_(0x1) << PUF_QK_HW_SETTINGS_qk_disable_enroll_Pos) /* (PUF_QK_HW_SETTINGS) 0: Enroll operations are enabled 1: Enroll operations are disabled Mask */
#define PUF_QK_HW_SETTINGS_qk_disable_enroll(value) (PUF_QK_HW_SETTINGS_qk_disable_enroll_Msk & (_UINT32_(value) << PUF_QK_HW_SETTINGS_qk_disable_enroll_Pos)) /* Assignment of value for qk_disable_enroll in the PUF_QK_HW_SETTINGS register */
#define PUF_QK_HW_SETTINGS_qk_disable_start_Pos _UINT32_(2)                                          /* (PUF_QK_HW_SETTINGS) 0: Start operations are enabled 1: Start operations are disabled Position */
#define PUF_QK_HW_SETTINGS_qk_disable_start_Msk (_UINT32_(0x1) << PUF_QK_HW_SETTINGS_qk_disable_start_Pos) /* (PUF_QK_HW_SETTINGS) 0: Start operations are enabled 1: Start operations are disabled Mask */
#define PUF_QK_HW_SETTINGS_qk_disable_start(value) (PUF_QK_HW_SETTINGS_qk_disable_start_Msk & (_UINT32_(value) << PUF_QK_HW_SETTINGS_qk_disable_start_Pos)) /* Assignment of value for qk_disable_start in the PUF_QK_HW_SETTINGS register */
#define PUF_QK_HW_SETTINGS_qk_disable_reconstruct_Pos _UINT32_(3)                                          /* (PUF_QK_HW_SETTINGS) 0: Reconstruct operations are enabled 1: Reconstruct operations are disabled Position */
#define PUF_QK_HW_SETTINGS_qk_disable_reconstruct_Msk (_UINT32_(0x1) << PUF_QK_HW_SETTINGS_qk_disable_reconstruct_Pos) /* (PUF_QK_HW_SETTINGS) 0: Reconstruct operations are enabled 1: Reconstruct operations are disabled Mask */
#define PUF_QK_HW_SETTINGS_qk_disable_reconstruct(value) (PUF_QK_HW_SETTINGS_qk_disable_reconstruct_Msk & (_UINT32_(value) << PUF_QK_HW_SETTINGS_qk_disable_reconstruct_Pos)) /* Assignment of value for qk_disable_reconstruct in the PUF_QK_HW_SETTINGS register */
#define PUF_QK_HW_SETTINGS_qk_disable_stop_Pos _UINT32_(5)                                          /* (PUF_QK_HW_SETTINGS) 0: Stop operations are enabled 1: Stop operations are disabled Position */
#define PUF_QK_HW_SETTINGS_qk_disable_stop_Msk (_UINT32_(0x1) << PUF_QK_HW_SETTINGS_qk_disable_stop_Pos) /* (PUF_QK_HW_SETTINGS) 0: Stop operations are enabled 1: Stop operations are disabled Mask */
#define PUF_QK_HW_SETTINGS_qk_disable_stop(value) (PUF_QK_HW_SETTINGS_qk_disable_stop_Msk & (_UINT32_(value) << PUF_QK_HW_SETTINGS_qk_disable_stop_Pos)) /* Assignment of value for qk_disable_stop in the PUF_QK_HW_SETTINGS register */
#define PUF_QK_HW_SETTINGS_qk_disable_get_key_Pos _UINT32_(6)                                          /* (PUF_QK_HW_SETTINGS) 0: Get Key operations are enabled 1: Get Key operations are disabled Position */
#define PUF_QK_HW_SETTINGS_qk_disable_get_key_Msk (_UINT32_(0x1) << PUF_QK_HW_SETTINGS_qk_disable_get_key_Pos) /* (PUF_QK_HW_SETTINGS) 0: Get Key operations are enabled 1: Get Key operations are disabled Mask */
#define PUF_QK_HW_SETTINGS_qk_disable_get_key(value) (PUF_QK_HW_SETTINGS_qk_disable_get_key_Msk & (_UINT32_(value) << PUF_QK_HW_SETTINGS_qk_disable_get_key_Pos)) /* Assignment of value for qk_disable_get_key in the PUF_QK_HW_SETTINGS register */
#define PUF_QK_HW_SETTINGS_qk_disable_unwrap_Pos _UINT32_(7)                                          /* (PUF_QK_HW_SETTINGS) 0: Unwrap operations are enabled 1: Unwrap operations are disabled Position */
#define PUF_QK_HW_SETTINGS_qk_disable_unwrap_Msk (_UINT32_(0x1) << PUF_QK_HW_SETTINGS_qk_disable_unwrap_Pos) /* (PUF_QK_HW_SETTINGS) 0: Unwrap operations are enabled 1: Unwrap operations are disabled Mask */
#define PUF_QK_HW_SETTINGS_qk_disable_unwrap(value) (PUF_QK_HW_SETTINGS_qk_disable_unwrap_Msk & (_UINT32_(value) << PUF_QK_HW_SETTINGS_qk_disable_unwrap_Pos)) /* Assignment of value for qk_disable_unwrap in the PUF_QK_HW_SETTINGS register */
#define PUF_QK_HW_SETTINGS_qk_disable_wrap_generated_random_Pos _UINT32_(8)                                          /* (PUF_QK_HW_SETTINGS) 0: Wrap Generated Random operations are enabled 1: Wrap Generated Random operations are disabled Position */
#define PUF_QK_HW_SETTINGS_qk_disable_wrap_generated_random_Msk (_UINT32_(0x1) << PUF_QK_HW_SETTINGS_qk_disable_wrap_generated_random_Pos) /* (PUF_QK_HW_SETTINGS) 0: Wrap Generated Random operations are enabled 1: Wrap Generated Random operations are disabled Mask */
#define PUF_QK_HW_SETTINGS_qk_disable_wrap_generated_random(value) (PUF_QK_HW_SETTINGS_qk_disable_wrap_generated_random_Msk & (_UINT32_(value) << PUF_QK_HW_SETTINGS_qk_disable_wrap_generated_random_Pos)) /* Assignment of value for qk_disable_wrap_generated_random in the PUF_QK_HW_SETTINGS register */
#define PUF_QK_HW_SETTINGS_qk_disable_wrap_Pos _UINT32_(9)                                          /* (PUF_QK_HW_SETTINGS) 0: Wrap operations are enabled 1: Wrap operations are disabled Position */
#define PUF_QK_HW_SETTINGS_qk_disable_wrap_Msk (_UINT32_(0x1) << PUF_QK_HW_SETTINGS_qk_disable_wrap_Pos) /* (PUF_QK_HW_SETTINGS) 0: Wrap operations are enabled 1: Wrap operations are disabled Mask */
#define PUF_QK_HW_SETTINGS_qk_disable_wrap(value) (PUF_QK_HW_SETTINGS_qk_disable_wrap_Msk & (_UINT32_(value) << PUF_QK_HW_SETTINGS_qk_disable_wrap_Pos)) /* Assignment of value for qk_disable_wrap in the PUF_QK_HW_SETTINGS register */
#define PUF_QK_HW_SETTINGS_qk_disable_generate_random_Pos _UINT32_(15)                                         /* (PUF_QK_HW_SETTINGS) 0: Generate Random operations are enabled 1: Generate Random operations are disabled Position */
#define PUF_QK_HW_SETTINGS_qk_disable_generate_random_Msk (_UINT32_(0x1) << PUF_QK_HW_SETTINGS_qk_disable_generate_random_Pos) /* (PUF_QK_HW_SETTINGS) 0: Generate Random operations are enabled 1: Generate Random operations are disabled Mask */
#define PUF_QK_HW_SETTINGS_qk_disable_generate_random(value) (PUF_QK_HW_SETTINGS_qk_disable_generate_random_Msk & (_UINT32_(value) << PUF_QK_HW_SETTINGS_qk_disable_generate_random_Pos)) /* Assignment of value for qk_disable_generate_random in the PUF_QK_HW_SETTINGS register */
#define PUF_QK_HW_SETTINGS_qk_skip_memory_test_Pos _UINT32_(29)                                         /* (PUF_QK_HW_SETTINGS) 0: Includes memory test during initialization 1: Skips memory test during initialization Position */
#define PUF_QK_HW_SETTINGS_qk_skip_memory_test_Msk (_UINT32_(0x1) << PUF_QK_HW_SETTINGS_qk_skip_memory_test_Pos) /* (PUF_QK_HW_SETTINGS) 0: Includes memory test during initialization 1: Skips memory test during initialization Mask */
#define PUF_QK_HW_SETTINGS_qk_skip_memory_test(value) (PUF_QK_HW_SETTINGS_qk_skip_memory_test_Msk & (_UINT32_(value) << PUF_QK_HW_SETTINGS_qk_skip_memory_test_Pos)) /* Assignment of value for qk_skip_memory_test in the PUF_QK_HW_SETTINGS register */
#define PUF_QK_HW_SETTINGS_qk_disable_test_memory_Pos _UINT32_(30)                                         /* (PUF_QK_HW_SETTINGS) 0: Test Memory operations are enabled 1: Test Memory operations are disabled Position */
#define PUF_QK_HW_SETTINGS_qk_disable_test_memory_Msk (_UINT32_(0x1) << PUF_QK_HW_SETTINGS_qk_disable_test_memory_Pos) /* (PUF_QK_HW_SETTINGS) 0: Test Memory operations are enabled 1: Test Memory operations are disabled Mask */
#define PUF_QK_HW_SETTINGS_qk_disable_test_memory(value) (PUF_QK_HW_SETTINGS_qk_disable_test_memory_Msk & (_UINT32_(value) << PUF_QK_HW_SETTINGS_qk_disable_test_memory_Pos)) /* Assignment of value for qk_disable_test_memory in the PUF_QK_HW_SETTINGS register */
#define PUF_QK_HW_SETTINGS_qk_disable_test_puf_Pos _UINT32_(31)                                         /* (PUF_QK_HW_SETTINGS) 0: Test PUF operations are enabled 1: Test PUF operations are disabled Position */
#define PUF_QK_HW_SETTINGS_qk_disable_test_puf_Msk (_UINT32_(0x1) << PUF_QK_HW_SETTINGS_qk_disable_test_puf_Pos) /* (PUF_QK_HW_SETTINGS) 0: Test PUF operations are enabled 1: Test PUF operations are disabled Mask */
#define PUF_QK_HW_SETTINGS_qk_disable_test_puf(value) (PUF_QK_HW_SETTINGS_qk_disable_test_puf_Msk & (_UINT32_(value) << PUF_QK_HW_SETTINGS_qk_disable_test_puf_Pos)) /* Assignment of value for qk_disable_test_puf in the PUF_QK_HW_SETTINGS register */
#define PUF_QK_HW_SETTINGS_Msk                _UINT32_(0xE00083EE)                                 /* (PUF_QK_HW_SETTINGS) Register Mask  */


