Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/puf.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* PUF register API structure */
typedef struct
{  /* Physically Unclonable Function */
  __IO  uint32_t                       PUF_CTRLA;          /* Offset: 0x00 (R/W  32) Control Register A */
  __I   uint8_t                        Reserved1[0x34];
  __I   uint32_t                       PUF_STATUSA;        /* Offset: 0x38 (R/   32) Status Register A */
  __I   uint8_t                        Reserved2[0xC4];
  __IO  uint32_t                       PUF_DISABLE;        /* Offset: 0x100 (R/W  32) Disable Function Control Register */
  __IO  uint32_t                       PUF_RESTRICT0;      /* Offset: 0x104 (R/W  32) Restrict User Context 0 Control Register */
  __IO  uint32_t                       PUF_RESTRICT1;      /* Offset: 0x108 (R/W  32) Restrict User Context 1 Control Register */
  __IO  uint32_t                       PUF_CTRL_PWR;       /* Offset: 0x10C (R/W  32) Power Control Register */
  __IO  uint32_t                       PUF_CTRL_KEY;       /* Offset: 0x110 (R/W  32) KEY Control Register */
  __I   uint8_t                        Reserved3[0xEC];
  __IO  uint32_t                       PUF_QK_CR;          /* Offset: 0x200 (R/W  32) Control register; The Control register defines which command must be executed next. When the command is accepted or rejected, the bits automatically revert to 0. Only one command bit may be written with 1 at a time, with the exception of qk_zeroize. Writing qk_zeroize with 1 takes precedence over all other commands. */
  __I   uint32_t                       PUF_QK_ORR;         /* Offset: 0x204 (R/   32) Operation Result register; The Operation Result register provides the result code of the last operation (Initialization, Generate Random, etc.). The value in this register is only valid when qk_busy = 0. */
  __IO  uint32_t                       PUF_QK_SR;          /* Offset: 0x208 (R/W  32) Status register; The Status register shows the current status of QuiddiKey and indicates whether a data transfer is requested. */
  __I   uint32_t                       PUF_QK_AR;          /* Offset: 0x20C (R/   32) Allow register; The Allow register indicates which operations are currently allowed. */
  __IO  uint32_t                       PUF_QK_IER;         /* Offset: 0x210 (R/W  32) Interrupt Enable register; With the Interrupt Enable register all QuiddiKey interrupts can be enabled or disabled, without changing the Interrupt Mask register. */
  __IO  uint32_t                       PUF_QK_IMR;         /* Offset: 0x214 (R/W  32) Interrupt Mask register; Individual QuiddiKey interrupts can be enabled or disabled with the Interrupt Mask register. */
  __IO  uint32_t                       PUF_QK_ISR;         /* Offset: 0x218 (R/W  32) Interrupt Status register; The Interrupt Status register indicates which interrupt has occurred. Multiple interrupts may occur at the same time (e.g. the busy interrupt occurs together with one of the ok and error interrupts). Writing 1 to a bit, clears the corresponding bit. */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       PUF_QK_DATA_DEST;   /* Offset: 0x220 (R/W  32) Data Destination register; The Data Destination register defines via which interface data is made available by QuiddiKey. Only one bit at a time may be 1. */
  __IO  uint32_t                       PUF_QK_DATA_SRC;    /* Offset: 0x224 (R/W  32) Data Source register; The Data Source register defines via which interface data must be provided to QuiddiKey. Combinations of bits may be 1 at a time. */
  __I   uint32_t                       PUF_QK_KEY_INDEX;   /* Offset: 0x228 (R/   32) Key Index register; The Key Index register provides the index of the key that is currently output. */
  __I   uint8_t                        Reserved5[0x74];
  __O   uint32_t                       PUF_QK_DIR;         /* Offset: 0x2A0 ( /W  32) Data Input register; The Data Input register is used to transfer data to QuiddiKey. It can only be written when input data is requested (indicated by the qk_di_request signal). When written at any other moment, or when read, an error response is generated. Depending on the way the system is configured and connected, this may generate an exception. */
  __I   uint8_t                        Reserved6[0x04];
  __I   uint32_t                       PUF_QK_DOR;         /* Offset: 0x2A8 (R/   32) Data Output register; The Data Output register is used to transfer data from QuiddiKey. It can only be read when input data is available (indicated by the qk_do_request signal). When read at any other moment, or when written, an error response is generated. Depending on the way the system is configured and connected, this may generate an exception. */
  __I   uint8_t                        Reserved7[0x14];
  __IO  uint32_t                       PUF_QK_MISC;        /* Offset: 0x2C0 (R/W  32) Miscellaneous register; The Miscellaneous register defines miscellaneous settings for QuiddiKey. These usually need to be configured only once after power up orreset. */
  __I   uint8_t                        Reserved8[0x0C];
  __IO  uint32_t                       PUF_QK_IF_SR;       /* Offset: 0x2D0 (R/W  32) Interface Status register; The status of the interface can be monitored with the Interface Status register. Writing 1 to a bit, clears the corresponding bit. */
  __I   uint8_t                        Reserved9[0x04];
  __IO  uint32_t                       PUF_QK_TEST;        /* Offset: 0x2D8 (R/W  32) Test register; With the Test register a BIST can be started. It also shows the result of the last BIST. */
  __I   uint32_t                       PUF_QK_PSR;         /* Offset: 0x2DC (R/   32) PUF Score register; The PUF Score register shows the value of the PUF Score that was obtained during the last Test PUF, Enroll, Start or Reconstruct operation. */
  __I   uint32_t                       PUF_QK_HW_RUC0;     /* Offset: 0x2E0 (R/   32) Module Restrict User Context 0 register; The Module Restrict User Context 0 register shows the values of the qk_restrict_user_context_0 signal on the signal interface. */
  __I   uint32_t                       PUF_QK_HW_RUC1;     /* Offset: 0x2E4 (R/   32) Module Restrict User Context 1 register; The Module Restrict User Context 1 register shows the values of the qk_restrict_user_context_1 signal on the signal interface. */
  __I   uint8_t                        Reserved10[0x08];
  __I   uint32_t                       PUF_QK_HW_SETTINGS; /* Offset: 0x2F0 (R/   32) Module Settings register; The Module Settings register shows the values of the module settings on the signal interface. */
  __I   uint32_t                       PUF_QK_HW_INFO;     /* Offset: 0x2F4 (R/   32) Module Information register; The Module Information register indicates which configuration of QuiddiKey is used for this module and which options it includes. */
  __I   uint32_t                       PUF_QK_HW_ID;       /* Offset: 0x2F8 (R/   32) Module Identifier register; The Module Identifier register provides the identifier of the QuiddiKey Engine netlist. */
  __I   uint32_t                       PUF_QK_HW_VER;      /* Offset: 0x2FC (R/   32) Module Version register; The Module Version register provides the version of this module: major.minor.patch. */
} puf_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMSG00_PUF_COMPONENT_H_ */
